---
type: Path3d
namespace: Autodesk.Revit.DB
version: 2024
members: 4
tags: [revit-api, class]
---

# Path3d

`Autodesk.Revit.DB.Path3d` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | AllCurveLoops | — | `public CurveArrArray AllCurveLoops { get ; }` |
| Property | CurveLoop | — | `public CurveArray this [ int index ] { get ; }` |
| Property | NumCurveLoops | — | `public int NumCurveLoops { get ; }` |
| Property | Parameter | — | `` |